{
  "modelTopology": "{\"class_name\":\"Model\",\"config\":{\"name\":\"model1\",\"layers\":[{\"name\":\"input1\",\"class_name\":\"InputLayer\",\"config\":{\"batch_input_shape\":[null,224,224,3],\"dtype\":\"float32\",\"sparse\":false,\"name\":\"input1\"},\"inbound_nodes\":[]},{\"name\":\"rescaling_Rescaling1\",\"class_name\":\"Rescaling\",\"config\":{\"scale\":0.00392156862745098,\"offset\":0,\"name\":\"rescaling_Rescaling1\",\"trainable\":true},\"inbound_nodes\":[[[\"input1\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D1\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":40,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[3,3],\"strides\":[2,2],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D1\",\"trainable\":true},\"inbound_nodes\":[[[\"rescaling_Rescaling1\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization1\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization1\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D1\",0,0,{}]]]},{\"name\":\"activation_Activation1\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation1\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization1\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D1\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[3,3],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D1\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation1\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization2\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization2\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D1\",0,0,{}]]]},{\"name\":\"activation_Activation2\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation2\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization2\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D1\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D1\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation2\",0,0,{}]]]},{\"name\":\"reshape_Reshape1\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,40],\"name\":\"reshape_Reshape1\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D1\",0,0,{}]]]},{\"name\":\"dense_Dense1\",\"class_name\":\"Dense\",\"config\":{\"units\":10,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense1\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape1\",0,0,{}]]]},{\"name\":\"dense_Dense2\",\"class_name\":\"Dense\",\"config\":{\"units\":40,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense2\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense1\",0,0,{}]]]},{\"name\":\"multiply_Multiply1\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply1\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation2\",0,0,{}],[\"dense_Dense2\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D2\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":24,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D2\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply1\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization3\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization3\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D2\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D2\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[3,3],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D2\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization3\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization4\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization4\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D2\",0,0,{}]]]},{\"name\":\"activation_Activation3\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation3\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization4\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D2\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D2\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation3\",0,0,{}]]]},{\"name\":\"reshape_Reshape2\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,24],\"name\":\"reshape_Reshape2\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D2\",0,0,{}]]]},{\"name\":\"dense_Dense3\",\"class_name\":\"Dense\",\"config\":{\"units\":6,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense3\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape2\",0,0,{}]]]},{\"name\":\"dense_Dense4\",\"class_name\":\"Dense\",\"config\":{\"units\":24,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense4\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense3\",0,0,{}]]]},{\"name\":\"multiply_Multiply2\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply2\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation3\",0,0,{}],[\"dense_Dense4\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D3\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":24,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D3\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply2\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization5\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization5\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D3\",0,0,{}]]]},{\"name\":\"dropout_Dropout1\",\"class_name\":\"Dropout\",\"config\":{\"rate\":0.2,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout1\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization5\",0,0,{}]]]},{\"name\":\"add_Add1\",\"class_name\":\"Add\",\"config\":{\"name\":\"add_Add1\",\"trainable\":true},\"inbound_nodes\":[[[\"dropout_Dropout1\",0,0,{}],[\"batch_normalization_BatchNormalization3\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D4\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":144,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D4\",\"trainable\":true},\"inbound_nodes\":[[[\"add_Add1\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization6\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization6\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D4\",0,0,{}]]]},{\"name\":\"activation_Activation4\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation4\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization6\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D3\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[3,3],\"strides\":[2,2],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D3\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation4\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization7\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization7\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D3\",0,0,{}]]]},{\"name\":\"activation_Activation5\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation5\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization7\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D3\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D3\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation5\",0,0,{}]]]},{\"name\":\"reshape_Reshape3\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,144],\"name\":\"reshape_Reshape3\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D3\",0,0,{}]]]},{\"name\":\"dense_Dense5\",\"class_name\":\"Dense\",\"config\":{\"units\":6,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense5\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape3\",0,0,{}]]]},{\"name\":\"dense_Dense6\",\"class_name\":\"Dense\",\"config\":{\"units\":144,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense6\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense5\",0,0,{}]]]},{\"name\":\"multiply_Multiply3\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply3\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation5\",0,0,{}],[\"dense_Dense6\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D5\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":32,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D5\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply3\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization8\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization8\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D5\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D6\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":192,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D6\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization8\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization9\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization9\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D6\",0,0,{}]]]},{\"name\":\"activation_Activation6\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation6\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization9\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D4\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[3,3],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D4\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation6\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization10\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization10\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D4\",0,0,{}]]]},{\"name\":\"activation_Activation7\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation7\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization10\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D4\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D4\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation7\",0,0,{}]]]},{\"name\":\"reshape_Reshape4\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,192],\"name\":\"reshape_Reshape4\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D4\",0,0,{}]]]},{\"name\":\"dense_Dense7\",\"class_name\":\"Dense\",\"config\":{\"units\":8,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense7\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape4\",0,0,{}]]]},{\"name\":\"dense_Dense8\",\"class_name\":\"Dense\",\"config\":{\"units\":192,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense8\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense7\",0,0,{}]]]},{\"name\":\"multiply_Multiply4\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply4\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation7\",0,0,{}],[\"dense_Dense8\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D7\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":32,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D7\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply4\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization11\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization11\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D7\",0,0,{}]]]},{\"name\":\"dropout_Dropout2\",\"class_name\":\"Dropout\",\"config\":{\"rate\":0.16666666666666669,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout2\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization11\",0,0,{}]]]},{\"name\":\"add_Add2\",\"class_name\":\"Add\",\"config\":{\"name\":\"add_Add2\",\"trainable\":true},\"inbound_nodes\":[[[\"dropout_Dropout2\",0,0,{}],[\"batch_normalization_BatchNormalization8\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D8\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":192,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D8\",\"trainable\":true},\"inbound_nodes\":[[[\"add_Add2\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization12\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization12\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D8\",0,0,{}]]]},{\"name\":\"activation_Activation8\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation8\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization12\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D5\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[3,3],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D5\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation8\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization13\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization13\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D5\",0,0,{}]]]},{\"name\":\"activation_Activation9\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation9\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization13\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D5\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D5\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation9\",0,0,{}]]]},{\"name\":\"reshape_Reshape5\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,192],\"name\":\"reshape_Reshape5\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D5\",0,0,{}]]]},{\"name\":\"dense_Dense9\",\"class_name\":\"Dense\",\"config\":{\"units\":8,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense9\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape5\",0,0,{}]]]},{\"name\":\"dense_Dense10\",\"class_name\":\"Dense\",\"config\":{\"units\":192,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense10\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense9\",0,0,{}]]]},{\"name\":\"multiply_Multiply5\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply5\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation9\",0,0,{}],[\"dense_Dense10\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D9\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":32,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D9\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply5\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization14\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization14\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D9\",0,0,{}]]]},{\"name\":\"dropout_Dropout3\",\"class_name\":\"Dropout\",\"config\":{\"rate\":0.23333333333333334,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout3\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization14\",0,0,{}]]]},{\"name\":\"add_Add3\",\"class_name\":\"Add\",\"config\":{\"name\":\"add_Add3\",\"trainable\":true},\"inbound_nodes\":[[[\"dropout_Dropout3\",0,0,{}],[\"add_Add2\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D10\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":192,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D10\",\"trainable\":true},\"inbound_nodes\":[[[\"add_Add3\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization15\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization15\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D10\",0,0,{}]]]},{\"name\":\"activation_Activation10\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation10\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization15\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D6\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[5,5],\"strides\":[2,2],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D6\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation10\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization16\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization16\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D6\",0,0,{}]]]},{\"name\":\"activation_Activation11\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation11\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization16\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D6\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D6\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation11\",0,0,{}]]]},{\"name\":\"reshape_Reshape6\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,192],\"name\":\"reshape_Reshape6\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D6\",0,0,{}]]]},{\"name\":\"dense_Dense11\",\"class_name\":\"Dense\",\"config\":{\"units\":8,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense11\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape6\",0,0,{}]]]},{\"name\":\"dense_Dense12\",\"class_name\":\"Dense\",\"config\":{\"units\":192,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense12\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense11\",0,0,{}]]]},{\"name\":\"multiply_Multiply6\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply6\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation11\",0,0,{}],[\"dense_Dense12\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D11\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":48,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D11\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply6\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization17\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization17\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D11\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D12\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":288,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D12\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization17\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization18\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization18\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D12\",0,0,{}]]]},{\"name\":\"activation_Activation12\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation12\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization18\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D7\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[5,5],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D7\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation12\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization19\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization19\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D7\",0,0,{}]]]},{\"name\":\"activation_Activation13\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation13\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization19\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D7\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",\"name\":\"global_average_pooling2d_GlobalAveragePooling2D7\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation13\",0,0,{}]]]},{\"name\":\"reshape_Reshape7\",\"class_name\":\"Reshape\",\"config\":{\"target_shape\":[1,1,288],\"name\":\"reshape_Reshape7\",\"trainable\":true},\"inbound_nodes\":[[[\"global_average_pooling2d_GlobalAveragePooling2D7\",0,0,{}]]]},{\"name\":\"dense_Dense13\",\"class_name\":\"Dense\",\"config\":{\"units\":12,\"activation\":\"swish\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense13\",\"trainable\":true},\"inbound_nodes\":[[[\"reshape_Reshape7\",0,0,{}]]]},{\"name\":\"dense_Dense14\",\"class_name\":\"Dense\",\"config\":{\"units\":288,\"activation\":\"sigmoid\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense14\",\"trainable\":true},\"inbound_nodes\":[[[\"dense_Dense13\",0,0,{}]]]},{\"name\":\"multiply_Multiply7\",\"class_name\":\"Multiply\",\"config\":{\"name\":\"multiply_Multiply7\",\"trainable\":true},\"inbound_nodes\":[[[\"activation_Activation13\",0,0,{}],[\"dense_Dense14\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D13\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":48,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D13\",\"trainable\":true},\"inbound_nodes\":[[[\"multiply_Multiply7\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization20\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization20\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D13\",0,0,{}]]]},{\"name\":\"dropout_Dropout4\",\"class_name\":\"Dropout\",\"config\":{\"rate\":0.16666666666666669,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout4\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization20\",0,0,{}]]]},{\"name\":\"add_Add4\",\"class_name\":\"Add\",\"config\":{\"name\":\"add_Add4\",\"trainable\":true},\"inbound_nodes\":[[[\"dropout_Dropout4\",0,0,{}],[\"batch_normalization_BatchNormalization17\",0,0,{}]]]},{\"name\":\"conv2d_Conv2D14\",\"class_name\":\"Conv2D\",\"config\":{\"filters\":288,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":2,\"mode\":\"fan_in\",\"distribution\":\"normal\",\"seed\":null}},\"kernel_regularizer\":null,\"kernel_constraint\":null,\"kernel_size\":[1,1],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"conv2d_Conv2D14\",\"trainable\":true},\"inbound_nodes\":[[[\"add_Add4\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization21\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization21\",\"trainable\":true},\"inbound_nodes\":[[[\"conv2d_Conv2D14\",0,0,{}]]]},{\"name\":\"activation_Activation14\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation14\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization21\",0,0,{}]]]},{\"name\":\"depthwise_conv2d_DepthwiseConv2D8\",\"class_name\":\"DepthwiseConv2D\",\"config\":{\"kernel_size\":[5,5],\"strides\":[1,1],\"padding\":\"same\",\"data_format\":\"channels_last\",\"dilation_rate\":[1,1],\"activation\":\"linear\",\"use_bias\":false,\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"bias_regularizer\":null,\"activity_regularizer\":null,\"bias_constraint\":null,\"name\":\"depthwise_conv2d_DepthwiseConv2D8\",\"trainable\":true,\"depth_multiplier\":1,\"depthwise_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"depthwise_regularizer\":null,\"depthwise_constraint\":null},\"inbound_nodes\":[[[\"activation_Activation14\",0,0,{}]]]},{\"name\":\"batch_normalization_BatchNormalization22\",\"class_name\":\"BatchNormalization\",\"config\":{\"axis\":-1,\"momentum\":0.99,\"epsilon\":0.001,\"center\":true,\"scale\":true,\"beta_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"gamma_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"moving_mean_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"moving_variance_initializer\":{\"class_name\":\"Ones\",\"config\":{}},\"beta_regularizer\":null,\"gamma_regularizer\":null,\"beta_constraint\":null,\"gamma_constraint\":null,\"name\":\"batch_normalization_BatchNormalization22\",\"trainable\":true},\"inbound_nodes\":[[[\"depthwise_conv2d_DepthwiseConv2D8\",0,0,{}]]]},{\"name\":\"activation_Activation15\",\"class_name\":\"Activation\",\"config\":{\"activation\":\"swish\",\"name\":\"activation_Activation15\",\"trainable\":true},\"inbound_nodes\":[[[\"batch_normalization_BatchNormalization22\",0,0,{}]]]},{\"name\":\"global_average_pooling2d_GlobalAveragePooling2D8\",\"class_name\":\"GlobalAveragePooling2D\",\"config\":{\"data_format\":\"channels_last\",